var express = require('express');
var router = express.Router();
var College = require('../models/college');
/* GET home page. */
router.get('/', function(req, res, next) {
    res.render('index', { title: 'Express' });
});


/* GET colleges page. */
router.get('/colleges', function(req, res, next) {
    College.find(function(err, colleges) {
        if (err) return console.err(err);
        res.render('colleges', { title: 'Коледжі', colleges: colleges });
    });
});

router.get("/setup-db", function(req, res) {
    var colleges = [{
            Name: "НУХТ",
            Desc: "Споруда, в якій розміщується Кам’янець-Подільський коледж харчової промисловості НУХТ, має типове планування для монастиря: замкнутий внутрішній двір та розгорнутий по прямій лінії фасад. Історія цього будинку пов’язана з черницями ордену візиток, для яких він і був споруджений. Візитки з’явилися в Кам’янці-Подільському завдяки старанням графа М.Грохольського, що займав посаду Подільського губернатора.",
            Image: "http://kp-cfi.km.ua/images/IMG_2680cr.jpg"
        },
        {
            Name: "ДВНЗ",
            Desc: "ДВНЗ “Кам’янець-Подільський індустріальний коледж” – це сучасний вищий навчальний заклад, широко відомий своїми випускниками не тільки на території України, а й поза її межами. Кам’янець-Подільський індустріальний технікум був створений Постановою Раднаркому СРСР і ЦК ВКП(б) в 1945 році. Найперша спеціальність “Електроустаткування промислових підприємств і установок” існує до сьогоднішнього дня, і її випускники користуються великим попитом на ринку праці.",
            Image: "http://kam-pod.info/images/indystria_glavnaya.jpg"
        },
        {
            Name: "ПДАТУ",
            Desc: "7 червня 1921 р. затверджено рішення агрономічної ради при Новоушицькому повітовому земельному відділі, повітовому відділі народної освіти про завідувач відділом Каніцький Ю.М.З 2008 року відділ розпочав підготовку техніків-механіків за фахом: «Експлуатація та ремонт машин і обладнання агропромислового виробництва».",
            Image: "http://kam-pod.info/images/coledz_pday.jpg"
        },
        {
            Name: "НУ ДПС",
            Desc: "Каменец-Подольский филиал Национального университета государственной налоговой службы Украины.Лицензия министерства образования Украины от 26.03.2009р. протокол заседания  ДАК МОН Украины от 01.07.2008 г. №72.Директор филиала Савчук Анатолий НиколаевичКаменец-Подольское отделение Киевского финансово - экономического колледжа  НУ ДПС Украины.",
            Image: "http://www.kam-pod.info/images/fasad-nalogovou-edy.jpg"
        },
        {
            Name: "КПМУ",
            Desc: "Медичне училище засноване было основано более, чем 130 лет назад. 28 декабря 1876 года Медицинский Департамент России издал приказ по которому «… в городе Каменце-Подольском Подольской губернии открыть медицинское учреждение — повивальную школу на 12 учениц, сроком обучения 2 года».По итогам рейтинговых исследований 2010 года Президиумом Всеукраинского научно-исследовательского центра эффективного управления Каменец-Подольском медицинскому училищу присуждена почетная награда «Знак безупречности» с вручением медали и диплома, а также принято решение наградить директора училища Смольницкую Ярославу Дмитриевну  высшей наградой Украины Орденом Королевы Анны «Честь Отечества» на серебряной звезде.",
            Image: "http://s004.radikal.ru/i206/1012/a0/004a4eaf5e30.jpg"
        },
        {
            Name: "САИД",
            Desc: "Лицензия АВ № 529261 от 11 июня 2010 г. Дата основания - 1957 год.Форма обучения: дневная, заочная. По государственному заказу и по контракту. Директор Сильченко Надежда Антоновна.коледж  На базе 9 классов проводится набор на специальности: - архитектурное проектирование и внутренний интерьер; - строительство и эксплуатация зданий и сооружений; -  изготовление строительных деталей и конструкций. ",
            Image: "http://kam-pod.info/images/img_mmm7156447.jpg"
        }
    ];

    College.remove({}, function(err) {
        if (err) {
            console.error(err);
        } else {

            for (let i = 0; i < colleges.length; i++) {
                College.create(colleges[i], function(err, College) {
                    if (err) console.error('Error: ' + err);
                    else console.log();
                });
            }
        }
    });
    res.status(200).json({
        message: "Okey",
    });

});

/* GET contacts page. */
router.get('/contacts', function(req, res, next) {
    res.render('contacts', { title: 'Contacts' });
});

module.exports = router;